#include "figures.h"

/**
 * @brief Массив, содержащий информацию о фигурах игры в различных состояниях
 * поворота.
 *
 * Каждая фигура представлена как двумерный массив 4x4, где 1 — это клетка
 * фигуры, а 0 — пустая клетка. Фигуры поворачиваются на 90 градусов по часовой
 * стрелке.</br>
 * Размеры:
 * - FIGURE_CNT: количество типов фигур (7 фигур).
 * - FIGURE_ROUNDS: количество возможных поворотов для каждой фигуры (4
 * поворота).
 */
static int **Figures[FIGURE_CNT][FIGURE_ROUNDS] = {
    // clang-format off
    /* Линия (I-образная фигура) */
    {/* Поворот 0 */
     (int *[]){
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 0, 0, 0},
         (int[]){1, 1, 1, 1},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0},
         (int[]){0, 1, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){0, 0, 0, 0},
         (int[]){1, 1, 1, 1},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* Обратная L-образная фигура (J-образная) */
    {/* Поворот 0 */
     (int *[]){
         (int[]){2, 0, 0, 0},
         (int[]){2, 2, 2, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 2, 2, 0},
         (int[]){0, 2, 0, 0},
         (int[]){0, 2, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 0, 0, 0},
         (int[]){2, 2, 2, 0},
         (int[]){0, 0, 2, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){0, 2, 0, 0},
         (int[]){0, 2, 0, 0},
         (int[]){2, 2, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* L-образная фигура */
    {/* Поворот 0 */
     (int *[]){
         (int[]){0, 0, 3, 0},
         (int[]){3, 3, 3, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 3, 0, 0},
         (int[]){0, 3, 0, 0},
         (int[]){0, 3, 3, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 0, 0, 0},
         (int[]){3, 3, 3, 0},
         (int[]){3, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){3, 3, 0, 0},
         (int[]){0, 3, 0, 0},
         (int[]){0, 3, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* Квадрат (O-образная фигура) */
    {/* Поворот 0 */
     (int *[]){
         (int[]){0, 4, 4, 0},
         (int[]){0, 4, 4, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 4, 4, 0},
         (int[]){0, 4, 4, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 4, 4, 0},
         (int[]){0, 4, 4, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){0, 4, 4, 0},
         (int[]){0, 4, 4, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* T-образная фигура */
    {/* Поворот 0 */
     (int *[]){
         (int[]){0, 5, 0, 0},
         (int[]){5, 5, 5, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 5, 0, 0},
         (int[]){0, 5, 5, 0},
         (int[]){0, 5, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 0, 0, 0},
         (int[]){5, 5, 5, 0},
         (int[]){0, 5, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){0, 5, 0, 0},
         (int[]){5, 5, 0, 0},
         (int[]){0, 5, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* Z-образная фигура */
    {/* Поворот 0 */
     (int *[]){
         (int[]){6, 6, 0, 0},
         (int[]){0, 6, 6, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){0, 6, 0, 0},
         (int[]){6, 6, 0, 0},
         (int[]){6, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){6, 6, 0, 0},
         (int[]){0, 6, 6, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){0, 6, 0, 0},
         (int[]){6, 6, 0, 0},
         (int[]){6, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     }},
    /* Обратная Z-образная фигура (S-образная) */
    {/* Поворот 0 */
     (int *[]){
         (int[]){0, 7, 7, 0},
         (int[]){7, 7, 0, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 90 */
     (int *[]){
         (int[]){7, 0, 0, 0},
         (int[]){7, 7, 0, 0},
         (int[]){0, 7, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 180 */
     (int *[]){
         (int[]){0, 7, 7, 0},
         (int[]){7, 7, 0, 0},
         (int[]){0, 0, 0, 0},
         (int[]){0, 0, 0, 0}
     },
     /* Поворот 270 */
     (int *[]){
         (int[]){7, 0, 0, 0},
         (int[]){7, 7, 0, 0},
         (int[]){0, 7, 0, 0},
         (int[]){0, 0, 0, 0}
     }}
    // clang-format on
};

int** getFigureType(int type, int rotation) {
    return Figures[type][rotation];
}
